# Dotfiles Brewfile
# Install with: brew bundle --file=installation/Brewfile

# Build dependencies (required for Neovim and high-performance plugins)
brew "cmake"                  # Build system for compiling native extensions
brew "ninja"                  # High-speed build system for native Neovim plugins
brew "gettext"                # Internationalization library

# Search and file tools
brew "ripgrep"                # Fast line-oriented search tool
brew "fd"                     # Simple, fast alternative to find
brew "bat"                    # Cat clone with syntax highlighting (used by fzf previews)
brew "fzf"                    # Command-line fuzzy finder
brew "zoxide"                 # Smarter cd command - tracks frequently used directories
brew "tree-sitter"            # Parser generator for syntax highlighting in Neovim
brew "jq"                     # Lightweight and flexible command-line JSON processor

# Shell and prompt
brew "zsh"                    # Primary shell
brew "starship"               # Minimal, blazing-fast, customizable prompt

# Version control
brew "git"                    # Version control
brew "git-open"               # Opens GitHub page for repo in browser

# Runtime management
brew "mise"                   # Multi-language version manager (Node, Python, etc.)

# Editor
brew "neovim"                 # Extensible text editor

# Security
brew "bitwarden-cli"          # Bitwarden password manager CLI (official)
brew "rbw"                    # Bitwarden password manager CLI (fast Rust alternative)

# Text-to-speech
tap "mazdak/tap"
brew "audiowhisper"           # Audio transcription and text-to-speech tool

# Container runtime
brew "colima"                 # Lightweight Docker-compatible container runtime

# GUI applications
cask "ghostty"                # Fast, native, GPU-accelerated terminal emulator
cask "karabiner-elements"     # Powerful keyboard customizer for macOS
cask "rectangle"              # Window management with keyboard shortcuts
cask "alttab"                 # Windows-style alt-tab window switcher
cask "claude-code"            # Official CLI for Claude AI
cask "zoom"                   # Video conferencing
cask "brave-browser"          # Privacy-focused web browser
cask "spotify"                # Music streaming service
cask "bitwarden"              # Password manager
cask "dropbox"                # Cloud storage and file synchronization
